Revit 2027 API
BarTypeDiameterOptions(RebarBarType) Constructor
 Constructs a new BarTypeDiameterOptions copying the diameter information from the bar type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BarTypeDiameterOptions(
	RebarBarType barType
)
Public Sub New (
	barType As RebarBarType
)
public:
BarTypeDiameterOptions(
	RebarBarType^ barType
)
new :
        barType : RebarBarType -> BarTypeDiameterOptions
Parameters
barType RebarBarType
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
BarTypeDiameterOptions Class
BarTypeDiameterOptions Overload
Autodesk.Revit.DB Namespace